controllers/PublicController.php

DELETE FROM `we_public` WHERE p_id='48'
---
	public function actionDel(){
		$request=Yii::$app->request;
		$id=$request->get('id');
		$re=Yii::$app->db->createCommand()->delete('we_public',"p_id=:id",[':id'=> $id])->execute();